{"index":{"panels":[[{"link":"http://expressjs.com/","title":"Express","content":"Express is a minimal and flexible Node.js web application framework that provides a robust set of features for web and mobile applications."},{"link":"https://pugjs.org/","title":"Pug","content":"Pug is a high performance template engine heavily influenced by Haml and implemented with JavaScript for Node.js and browsers."},{"link":"https://jquery.com/","title":"jQuery","content":"jQuery is a fast, small, and feature-rich JavaScript library."},{"link":"https://getuikit.com/v2/","title":"Uikit","content":"A lightweight and modular front-end framework for developing fast and powerful web interfaces."},{"link":"http://sigmajs.org/","title":"Sigma","content":"Sigma is a JavaScript library dedicated to graph drawing."}],[{"icon":"map-signs","title":"Direction de la ligne de métro à prendre","content":"En ajoutant des informations additionnelles au graphe, indiquez lors d’un changement la direction de la ligne à prendre (exemple : Prendre la ligne 14 direction Saint-Lazare)."},{"icon":"eraser","title":"Proposer des corrections de nom après soumission","content":"Petit corollaire du point précédent, si le nom d’une station soumis par l’utilisateur est introuvable en tant que tel, essayez de proposer des corrections du nom de station."},{"icon":"search","title":"Suggestion des noms de station","content":"Utilisez de l’auto-complétion pour les champs de texte afin de suggérer les noms des stations de départ et d’arrivée."},{"icon":"bug","title":"Gérer les erreurs","content":"Votre programme doit afficher une erreur et rester fonctionnel même si l’utilisateur effectue des saisies incorrectes."},{"icon":"map","title":"Affichage du parcours (correspondances incluses)","content":"Vous devez afficher votre parcours segment par segment, en indiquant à l’utilisateur quand il doit changer de ligne."},{"icon":"calculator","title":"Calcul d’un parcours","content":"Vous devez pouvoir proposer un parcours entre n’importe quels points de départ et d’arrivée, même non-optimal 3 , avec moins de 4 changements. Le graphe étant fortement connexe, aucun parcours n’est impossible."},{"icon":"edit","title":"Saisie d’une station de départ, d’une station d’arrivée","content":"Votre interface doit permettre de saisir une station de départ ainsi qu’une station d’arrivée, au format texte."}],[{"icon":"clock-o","title":"Proposer une estimation du temps de parcours","content":"Demandez une heure de départ à l’utilisateur, estimez son heure d’arrivée ainsi que son temps de trajet. Dans un premier temps, vous pouvez prendre les temps moyens suivants : 1.2 minutes entre chaque station, 20 secondes à quai, 1.5 minute pour une correspondance. Vous pouvez affiner ces temps en cherchant des temps de référence pour les correspondances sur Internet, si vous le souhaitez."},{"icon":"exclamation","title":"Impact de la pénalisation des changements","content":"Proposez à l’utilisateur de choisir la pénalisation à appliquer aux changements, et répercutez-la sur les poids des arcs du graphe"}]]}}